{
  "metric1": "eqr",
  "metric2": "q2e",
  "eval_metrics": [
    "map_at10",
    "map_at50"
  ],
  "query_ranks": {
    "Suggest a hotel that works well for working remotely.": 0.3073336312123761,
    "Where can I stay to avoid the tourist rush without going remote?": 0.27523574231848896,
    "What are the best hotels for exploring hidden gems in a city?": 0.25820082212021456,
    "Where can I stay that fits well with a photography-heavy trip?": 0.18999369568518504,
    "Where can I stay that works for multiple generations?": 0.18176319088097503,
    "Which hotels offer the best opportunities for socializing?": 0.17271321306282322,
    "What are some of the best hotels for gourmet lovers?": 0.16686695446567454,
    "Suggest a hotel where I can just go with the flow.": 0.16569329092403398,
    "Recommend a hotel with great family-friendly amenities.": 0.16488989340875984,
    "What are the top hotels for a scenic retreat?": 0.16399290145379913,
    "Suggest a hotel with a magical ambiance.": 0.1552179082361772,
    "Looking for a hotel with creative spaces and an artsy vibe.": 0.14923630725571413,
    "Recommend a pet-friendly hotel.": 0.1445504040884015,
    "Suggest a hotel that's perfect for art lovers.": 0.14168791425510724,
    "Recommend a hotel with a lively atmosphere.": 0.13743160690888737,
    "Recommend a hotel that works well for traveling with teenagers.": 0.12461419214818817,
    "What are the top boutique hotels?": 0.11430701455485928,
    "Recommend a hotel that feels intimate and private.": 0.10787983076158127,
    "Where can I find a hotel that balances luxury and affordability?": 0.10006241279859895,
    "Where can I find hotels with a unique architectural design?": 0.08414982197718474,
    "Suggest a hotel with the best spa services.": 0.06985675138613899,
    "Recommend a hotel that matches a slower travel rhythm.": 0.05583691785102822,
    "Where can I stay that feels youthful and energetic?": 0.053526837542119225,
    "What are the best hotels for wellness and relaxation?": 0.04509634406899987,
    "Where can I stay for the best sunrise or sunset views?": 0.043861149270130614,
    "Where can I find hotels that combine adventure and relaxation?": 0.04304369969331605,
    "Where can I find hotels with great rooftop bars?": 0.037645294443570974,
    "Where can I stay to get the best of both city and nature?": 0.02811475201054446,
    "Recommend a place for a solo birthday trip.": 0.02689470242353339,
    "Recommend a place where I won't feel like a tourist.": 0.02634214617425147,
    "Where can I stay with beautiful waterfront views?": 0.015983733707275953,
    "Where can I stay if I'm traveling with elderly parents?": 0.014628258812329509,
    "Where should I stay for easy airport access?": 0.004369656361276562,
    "I want a hotel that makes me feel like I’m in a movie.": 0.0017679914322547147,
    "Where can I stay that works well with young kids and no fuss?": -0.00300973133479307,
    "What hotels are affordable but don't feel basic?": -0.004816292213927022,
    "Suggest a hotel with excellent fine dining.": -0.006179466576062186,
    "Recommend a hotel that works well for group celebrations.": -0.011390201402274487,
    "Recommend a hotel with the best poolside service.": -0.02136287231683202,
    "Suggest a hotel that complements a journaling or reflection-focused trip.": -0.021656286367742306,
    "Recommend a hotel with a nostalgic, vintage vibe.": -0.03349938406291146,
    "Recommend a hotel for travellers who just want to people-watch.": -0.04410900588253047,
    "Where can I stay near the best art museums?": -0.04974594043189054,
    "Recommend a hotel that keeps surprising me every day.": -0.07775251146379103,
    "Where should I stay during a creative block?": -0.08591572743942869,
    "Where can I stay to fully experience the nightlife of a city?": -0.09023783921982483,
    "Suggest a hotel that doesn't feel too polished.": -0.10408873326131167,
    "Where should I stay that matches a high-energy trip?": -0.1548155653693012,
    "What are some hotels that are great for slow mornings?": -0.1662191278493714,
    "Where can I stay that fits a minimalist travel style?": -0.17413216697928197
  }
}