{
  "metric1": "q2d",
  "metric2": "q2e",
  "eval_metrics": [
    "map_at10",
    "map_at50"
  ],
  "query_ranks": {
    "Recommend a hotel with a lively atmosphere.": 0.4093289392651747,
    "Where can I stay for the best sunrise or sunset views?": 0.36855327924057896,
    "What are the best hotels for exploring hidden gems in a city?": 0.3290840383642844,
    "Looking for a hotel with creative spaces and an artsy vibe.": 0.32809474057228094,
    "Where can I stay to get the best of both city and nature?": 0.2725479518782982,
    "Where can I stay that fits well with a photography-heavy trip?": 0.25416104478604484,
    "Suggest a hotel with a magical ambiance.": 0.194397350321827,
    "What hotels are affordable but don't feel basic?": 0.18193982739548953,
    "What are some of the best hotels for gourmet lovers?": 0.16917794349915455,
    "Recommend a hotel with a nostalgic, vintage vibe.": 0.1656478945562046,
    "Recommend a hotel with great family-friendly amenities.": 0.16486896976738372,
    "Where can I stay that works for multiple generations?": 0.1592845261642971,
    "Recommend a hotel that feels intimate and private.": 0.15904542716334774,
    "Where can I stay near the best art museums?": 0.1549036722399315,
    "Recommend a hotel that matches a slower travel rhythm.": 0.153982245594334,
    "Recommend a pet-friendly hotel.": 0.14799841154760046,
    "Recommend a hotel that keeps surprising me every day.": 0.1476449459419109,
    "Suggest a hotel with the best spa services.": 0.14440646431215673,
    "Which hotels offer the best opportunities for socializing?": 0.13710479276241427,
    "Suggest a hotel that's perfect for art lovers.": 0.1255185088652205,
    "I want a hotel that makes me feel like I’m in a movie.": 0.09919098508304441,
    "Where can I stay to avoid the tourist rush without going remote?": 0.09179360404589562,
    "Where should I stay for easy airport access?": 0.08403955766938802,
    "What are some hotels that are great for slow mornings?": 0.08113066871571104,
    "Where can I stay that works well with young kids and no fuss?": 0.06649134315413571,
    "Where can I stay with beautiful waterfront views?": 0.049830602088504754,
    "Where can I find hotels with a unique architectural design?": 0.04746294743817581,
    "Where can I find hotels that combine adventure and relaxation?": 0.04195491327844268,
    "Suggest a hotel where I can just go with the flow.": 0.03386404613359648,
    "Recommend a hotel that works well for group celebrations.": 0.022813096074554083,
    "What are the best hotels for wellness and relaxation?": 0.022468596809906018,
    "Where can I find a hotel that balances luxury and affordability?": 0.021484404992133353,
    "Recommend a place for a solo birthday trip.": 0.014893693218998395,
    "Where can I stay that feels youthful and energetic?": 0.013579829496579807,
    "Suggest a hotel that works well for working remotely.": -0.005018478575351461,
    "What are the top boutique hotels?": -0.0054318093067064685,
    "What are the top hotels for a scenic retreat?": -0.013456219197268075,
    "Recommend a place where I won't feel like a tourist.": -0.02864218771385294,
    "Suggest a hotel with excellent fine dining.": -0.0404903661301409,
    "Recommend a hotel that works well for traveling with teenagers.": -0.06002966774377454,
    "Suggest a hotel that complements a journaling or reflection-focused trip.": -0.07486229529379682,
    "Where can I stay to fully experience the nightlife of a city?": -0.08912627813125451,
    "Recommend a hotel for travellers who just want to people-watch.": -0.09132364895182268,
    "Recommend a hotel with the best poolside service.": -0.09201113746439887,
    "Where can I stay if I'm traveling with elderly parents?": -0.10941576812618076,
    "Suggest a hotel that doesn't feel too polished.": -0.1111265232885015,
    "Where should I stay during a creative block?": -0.11271921157123516,
    "Where can I find hotels with great rooftop bars?": -0.12373525108075716,
    "Where can I stay that fits a minimalist travel style?": -0.1902850609441922,
    "Where should I stay that matches a high-energy trip?": -0.2611547611486289
  }
}